*** Closure Shittiness
in python, closure vars bound by *name*, not value :(
watch
#+BEGIN_SRC python
  adders = [lambda m: m + n for n in range(5)]
  return [adder(10) for adder in adders]
#+END_SRC

#+RESULTS:
| 14 | 14 | 14 | 14 | 14 |
damn
*** Closure Band-Aid
explicitly bind internal var via keyword
stop binding by name
#+BEGIN_SRC python
    adders = [lambda m, n = n: m + n for n in range(5)]
    return [adder(10) for adder in adders]
#+END_SRC

#+RESULTS:
| 10 | 11 | 12 | 13 | 14 |
yay!
